_posts/linux/2014-10-15-using-svn.html
---
layout: post
title: Install SVN in Linux
author: zrg
comments: false
description: 
categories:
- software
- linux
tags:
- SVN
photos:
---

<div class="org-center">
<p>
If you have questions, please send email to zrg1390556487@gmail.com.
</p>
</div>

<div id="outline-container-org399735d" class="outline-2">
<h2 id="org399735d">Preface</h2>
<div class="outline-text-2" id="text-org399735d">
<pre class="example">
I have always been fascinated website development. So, management and back up of code is very important. 
Last night, installed successfully SVN on linux. In fack,I have tried before,but did not write a decent note.Summarized today.

</pre>
</div>
</div>
<div id="outline-container-org167bf58" class="outline-2">
<h2 id="org167bf58">Installing</h2>
<div class="outline-text-2" id="text-org167bf58">
</div>
<div id="outline-container-org9fa15ad" class="outline-3">
<h3 id="org9fa15ad">environment</h3>
<div class="outline-text-3" id="text-org9fa15ad">
<pre class="example">
Linux kernel version: 3.10.0 
OS: CentOS 7
software: subversion

</pre>
</div>
</div>
<div id="outline-container-orgcbe244d" class="outline-3">
<h3 id="orgcbe244d">First Method: installing by source package</h3>
<div class="outline-text-3" id="text-orgcbe244d">
</div>
<div id="outline-container-orgd142a18" class="outline-4">
<h4 id="orgd142a18">Download and decompression</h4>
<div class="outline-text-4" id="text-orgd142a18">
<pre class="example">
Official Site: https://www.visualsvn.com
Dowload:
        1. wget http://subversion.tigris.org/downloads/subversion-1.6.1.tar.gz
        2. wget http://subversion.tigris.org/downloads/subversion-deps-1.6.1.tar.gz
Decompression command:
        tar zxvf subversion-1.6.1.tar.gz
        tar zxvf subversion-deps-1.6.1.tar.gz

</pre>
</div>
</div>
<div id="outline-container-org9ca6bf9" class="outline-4">
<h4 id="org9ca6bf9">Compile and install</h4>
<div class="outline-text-4" id="text-org9ca6bf9">
<pre class="example">
Command:
        ./configure --prefix=/usr/local/svn/
        make &amp;&amp; make install

</pre>
</div>
</div>
<div id="outline-container-org072aa85" class="outline-4">
<h4 id="org072aa85">Add command of svn to path</h4>
<div class="outline-text-4" id="text-org072aa85">
<pre class="example">
Comand:
       echo "export PATH=$PATH:/usr/local/svn/bin/" &gt;&gt; /etc/profile
       source /etc/profile


</pre>
</div>
</div>
</div>
<div id="outline-container-orgf73fa58" class="outline-3">
<h3 id="orgf73fa58">Second Method: yum install</h3>
<div class="outline-text-3" id="text-orgf73fa58">
<pre class="example">
yum install subversion mod_dav_svn

</pre>
</div>
</div>
</div>
<div id="outline-container-orgbd2f0fb" class="outline-2">
<h2 id="orgbd2f0fb">Build warehouse of test</h2>
<div class="outline-text-2" id="text-orgbd2f0fb">
</div>
<div id="outline-container-orga7153f9" class="outline-3">
<h3 id="orga7153f9">Build</h3>
<div class="outline-text-3" id="text-orga7153f9">
<pre class="example">
Build root directory of svn
mkdir -p /opt/svn

</pre>

<pre class="example">
Build warehoust of test
mkdir -p /opt/svn/svntest/
svnadmin create /opt/svn/svntest/

</pre>
</div>
</div>
<div id="outline-container-org8c3ce61" class="outline-3">
<h3 id="org8c3ce61">Configure</h3>
<div class="outline-text-3" id="text-org8c3ce61">
<pre class="example">
1.To directory of configure,There are three file here.
   cd /opt/svn/svntest/conf/
authz: Configure file about setting permissions of users.
passwd:  Configure file about setting username and password.
svnserve.conf: Configure file about svn.
2.svnserve.conf
vim svnserve.conf
edit:
     [general]
     anon-access = none
     auth-access = write
     password-db = passwd
     authz-db = authz
3.authz
add:
    [svntest:/]
    92csz.com = rw # add a user(92csz.com),read and write.
4.passwd
edit:
    92csz.com = 123456 # password is 123456


</pre>
</div>
</div>
</div>
<div id="outline-container-org864b8dd" class="outline-2">
<h2 id="org864b8dd">Start</h2>
<div class="outline-text-2" id="text-org864b8dd">
</div>
<div id="outline-container-org1079e7b" class="outline-3">
<h3 id="org1079e7b">Start service of SVN</h3>
<div class="outline-text-3" id="text-org1079e7b">
<pre class="example">
svnserve -d -r /opt/svn/

</pre>
</div>
</div>
<div id="outline-container-org80b6bbc" class="outline-3">
<h3 id="org80b6bbc">Check service</h3>
<div class="outline-text-3" id="text-org80b6bbc">
<pre class="example">
netstat -aux |grep svn
restult:
        tcp 000.0.0.0:3690.0.0.0:*  LISTEN  8646/svnserve


</pre>
</div>
</div>
<div id="outline-container-orgf6658a4" class="outline-3">
<h3 id="orgf6658a4">Change permission of user</h3>
<div class="outline-text-3" id="text-orgf6658a4">
<pre class="example">
Command:
        chmod -R 775 /opt/svn/
 or     chmod -R o+rw /opt/svn


</pre>
</div>
</div>
<div id="outline-container-org4c9f799" class="outline-3">
<h3 id="org4c9f799">Test by client</h3>
<div class="outline-text-3" id="text-org4c9f799">
<pre class="example">
Open svn client(right),Enter IP address of svn server and warehouse name
exmple:
       svn://192.168.120.166/svntest


</pre>
</div>
</div>
</div>
<div id="outline-container-org70d3332" class="outline-2">
<h2 id="org70d3332">Apache and Subversion</h2>
<div class="outline-text-2" id="text-org70d3332">
</div>
<div id="outline-container-org6924d46" class="outline-3">
<h3 id="org6924d46">Add this config file to apache</h3>
<div class="outline-text-3" id="text-org6924d46">
<div class="org-src-container">
<pre class="src src-emacs_lisp">LoadModule dav_svn_module     modules/mod_dav_svn.so
LoadModule authz_svn_module   modules/mod_authz_svn.so

&lt;Location /svn&gt;
   DAV svn
   SVNParentPath /var/www/unixmensvn
   AuthType Basic
   AuthName "Subversion repositories"
   AuthUserFile /etc/svn-auth-users
   Require valid-user
&lt;/Location&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org1d8b176" class="outline-3">
<h3 id="org1d8b176">Create SVN users</h3>
<div class="outline-text-3" id="text-org1d8b176">
<pre class="example">
htpasswd -cm /etc/svn-auth-users testuser1

</pre>
</div>
</div>
<div id="outline-container-org0fab3e2" class="outline-3">
<h3 id="org0fab3e2">Create and configure SVN repository</h3>
<div class="outline-text-3" id="text-org0fab3e2">
<pre class="example">
mkdir /var/www/unixmensvn
cd  /var/www/unixmensvn
svnadmin create repo
chown -R apache.apache repo

# If you still have issues with SELinux Security please apply this: 
chcon -R -t httpd_sys_content_t /var/www/unixmensvn/repo
chcon -R -t httpd_sys_rw_content_t /var/www/unixmensvn/repo

</pre>
</div>
</div>
<div id="outline-container-org399c8d2" class="outline-3">
<h3 id="org399c8d2">You can open the http and https on the file with thi way</h3>
<div class="outline-text-3" id="text-org399c8d2">
<pre class="example">
firewall-cmd --permanent --zone=public --add-service=http
firewall-cmd --permanent --zone=public --add-service=https
firewall-cmd --reload

</pre>
</div>
</div>
<div id="outline-container-org94ddb5e" class="outline-3">
<h3 id="org94ddb5e">Make trunk, branches and tags structure under repo</h3>
<div class="outline-text-3" id="text-org94ddb5e">
<pre class="example">
mkdir -p /tmp/svn-structure-template/{trunk,branches,tags}

svn import -m "Initial repository" /tmp/svn-structure-template   file:///var/www/unixmensvn/repo/
Adding         /tmp/svn-structure-template/branches
Adding         /tmp/svn-structure-template/tags
Adding         /tmp/svn-structure-template/trunk

</pre>
<p>
Committed revision 1.
</p>

<p>
Done!
</p>
</div>
</div>
</div>
<div id="outline-container-org250fe7c" class="outline-2">
<h2 id="org250fe7c">Question</h2>
<div class="outline-text-2" id="text-org250fe7c">
</div>
<div id="outline-container-org723eaa8" class="outline-3">
<h3 id="org723eaa8">Problem 1</h3>
<div class="outline-text-3" id="text-org723eaa8">
<pre class="example">
1.svn: Can’t open file ‘***/txn-current-lock’: Permission denied
Solve:
      Severth(Vew 7th section).

</pre>
</div>
</div>
<div id="outline-container-org2c8afa5" class="outline-3">
<h3 id="org2c8afa5">Problem 2</h3>
<div class="outline-text-3" id="text-org2c8afa5">
<pre class="example">
2.Happen "authorization failed" error client
Solve:
      Check configure.
### Evey establishment of a lirary need to be configured.This is very important.

</pre>
</div>
</div>
<div id="outline-container-org25b8026" class="outline-3">
<h3 id="org25b8026">Problem 3</h3>
<div class="outline-text-3" id="text-org25b8026">
<pre class="example">
3.When committing,error:
         post commit FS processing had error:
         "sqlite:attempt to write a readonly database"
Solve:
      into /opt/svn/wp-job/db , there is a file "rep-cache.db"
chown -R zrg.zrggroup rep-cache.db

</pre>
</div>
</div>
</div>
